f = open('filename')
text_modes = ['r', 'w', 'a', 'r+']
binary_modes = ['br', 'bw', 'ba', 'br+']

f = open('filename', 'w')

f.write('The world is changed. \n I taste it in the water.\n')
f.close()
#==============================================================
f = open('filename', 'r+')
f.read()
#==============================================================
f.tell() # говорит где находится курсор после чтения
f.seek(0) # перенос курсора в начало файла
#==============================================================
f = open('filename', 'r+')
f.readline() # чтение только одной строки
f.close
#==============================================================
f = open('filename', 'r+')
f.readlines() # чтение всех строк. вернет список строк разбитых символом переноса строки
#==============================================================
with open('filename') as f:
    print(f.read())
