"""
Напишите программу, на вход которой подаётся список чисел одной строкой. Программа должна для каждого элемента
этого списка вывести сумму двух его соседей. Для элементов списка, являющихся крайними, одним из соседей
считается элемент, находящий на противоположном конце этого списка. Например, если на вход подаётся
список "1 3 5 6 10", то на выход ожидается список "13 6 9 15 7" (без кавычек).
Если на вход пришло только одно число, надо вывести его же.
Вывод должен содержать одну строку с числами нового списка, разделёнными пробелом.
Sample Input 1:
1 3 5 6 10
Sample Output 1:
13 6 9 15 7
Sample Input 2:
10
Sample Output 2:
10
"""
# ===============================================================================================================
# list = list(map(int, input().split()))
# len = len(list)
# if len == 1:
#     print(list[0])
# else:
#     [print(list[i - 1] + list[i - len + 1], end=' ') for i in range(0, len)]
# # ===============================================================================================================
# list = [int(i) for i in input().split()]
# p = 0
# while p < len(list):
#     if len(list) == 1:
#         print(list[0])
#     elif p == 0:
#         print(list[-1] + list[p + 1], end=' ')
#     elif p == len(list) - 1:
#         print(list[p - 1] + list[0], end=' ')
#     else:
#         print(list[p - 1] + list[p + 1], end=' ')
#     p += 1
 # ===============================================================================================================
# a = [int(i) for i in input().split()]
# if len(a) == 1:
#     print(*a)
#     exit()
# for j in range(len(a)):
#     if j < len(a) - 1:
#         b = [(a[j - 1] + a[j + 1])]
#     else:
#         b = [(a[j - 1] + a[0])]
#     print(*b, end=' ')
# # ===============================================================================================================
# a = [int(i) for i in input().split()]
# b = len(a)
# [print(a[i - 1] * (1 - (b == 1)) + a[i - (b - 1)], end=' ') for i in range(0, b)]
# # ===============================================================================================================
# a = [int(i) for i in input().split()]
# if len(a) > 1:
#     for i in range(len(a)):
#         print(a[i - 1] + a[i + 1 - len(a)])
# else:
#     print(a[0])
# ===============================================================================================================
