"""
Напишите программу, которая выводит часть последовательности 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5 ... (число повторяется
 столько раз, чему равно). На вход программе передаётся неотрицательное целое число n — столько элементов
 последовательности должна отобразить программа. На выходе ожидается последовательность чисел, записанных
 через пробел в одну строку.
Например, если n = 7, то программа должна вывести 1 2 2 3 3 3 4.
"""

# ===============================================================================================================
# a = int(input())
# massive = []
# for j in range(1, a+1):
#     for i in [j for l in range(1, j+1)]:
#         massive.append(j)
# [print(massive[i], end = ' ') for i in range(len(massive[:a]))]
# ===============================================================================================================
# n = int(input())
# s = ''
# for i in range(n+1):
#     s += (str(i)+' ')*i
# print(*s.split()[:n])
# ===============================================================================================================
# n, a = int(input()), []
# for i in range(1, n + 1): a += ([i] * i)
# print(*a[:n])
# ===============================================================================================================
# a = int(input())
# b = []
# for i in range(1, a+1):
#     b += ([i] * i)
# print(*b[0:a])
# ===============================================================================================================
# n = int(input())
# q = []
# for i in range(1, n+1):
#     q += [str(i)] * i
# print(" ".join(q[:n]))
# ===============================================================================================================









