# Creating of functions
# Определение факториала числа
# def factorial(n):
#     result = 1
#    while n > 1:
#         result *= n
#         n -= 1
#     return result
# def cnk(n, k):
#     return factorial(n) // (factorial(k) * factorial(n - k))
# print(cnk(4, 2))
# ==============================================================================
# Определение максимума из двух чисел

# def max2(a, b):
#     if a > b:
#         return a
#     else:
#         return b
# print(max2(2, 8))
# print(max2(7, 2))
# print(max2(3, 3))
# ==============================================================================
# More simple:
# def max2(a, b):
#     if a > b:
#         return a
#     return b
# print(max2(2, 8))
# print(max2(7, 2))
# print(max2(3, 3))
# ==============================================================================

# def max2(a, b):
#     if a > b:
#         return a
#     return b


# def max3(a, b, c):
#     return max2(max(a, b), c)
# print (max3(1, 2, 3))
# ==============================================================================
# def sort2(a, b): # Печать по возрастанию цифр
#     if a < b:
#         return a, b
#     return b, a

# minimum, maximum = sort2(5, 4)
# print(minimum, maximum)

# ==============================================================================
# def isEven(n):
#     return n % 2 == 0

# n = int(input())
# if isEven(n):
#     print('EVEN')
# else:
#     print('ODD')
# ==============================================================================

# def f():
#     print(a)
# a = 1 # глобальная переменная, поскольку лежит не внутри функции
# f()
# ==============================================================================
#def f():
#    a = 1 # локальная переменная, поскольку лежит не внутри функции
#    print(a)

#a = 0 # глобальная переменная, поскольку лежит не внутри функции
#f()
# print(a)
# ==============================================================================

# def f():
#    global a # перечисление глобальных переменных указанных внутри функции
#    print(a)
#    a = 1

#a = 0
#f()
# print(a)

# ==============================================================================

# Рекурсия

# def rec():
#    n = int(input())
#    if n != 0:
#        if n % 2 == 0:
#            print(n)
#        rec()
#        if n != 0:
#            print(n)
#rec()
# ==============================================================================
# Кортежи(Tuple)
# MyTuple = (1, 2, 3)
# print(MyTuple[1])
# ==============================================================================
#MyTuple = (1, 2, 3)
#sTuple = (4, 5, 6)
#print(MyTuple + sTuple)

#MyTuple = (1, 2, 3)
#print(len(MyTuple))

#MyTuple = (1, 3.14, 'abc')
#print(MyTuple)

#MyTuple = (1, (2, 3), (4,))
#print(MyTuple[1][0])  print the second element of Tuple MyTuple and first value ofit

# man = ('Ivan', 'Ivanov', 28)
# print(man[-1])

# MyTuple = 1, 2, 3 #- здесь можно опустить скобки. В данном случае происходит упаковка кортежа
# a, b, c = MyTuple
# print(a, b) #- распаковка кортежа
# ==============================================================================
# a = 1
# b = 2
# a, b = b, a
# print(a,b)
# ==============================================================================

# myRange = range(100000)
# print(tuple(myRange))

# print(tuple('abcdef'))
# ==============================================================================

#for color in ('red', 'green', 'yellow'):
#    print(color, 'apple')

#for i in range(25):
#    print(i)

#for i in range(10, 21):
#    print(i)

#for i in range(-10, 21):
#    print(i, end= ' ')

#for i in range(1, 31, 2):
#    print(i, end= ' ')

# for i in range(1, 11):
#    for j in range(1, 11):
#        print(i * j, end='   ')
#    print()
# ==============================================================================
#a = [1, 2, 3]
#b = a
#a[0] = 4
#print(b)

# ==============================================================================
#a = [1, 2, 3]
#b = a[:]  # в данном случае выполнен срез а, поэтому будет выводится 1, 2, 3 - создается копия объекта
#a[0] = 4
#print(b)
# ==============================================================================
#def replaceFirst(fList):
#    fList[0] = 0
#a = [1, 2, 3]
#replaceFirst(a)
#print(a)
# ==============================================================================
# Списки
#a = list('abcdef')
# print(a)

#a = list('abcdef')
#a[0] = 'f'
#s = ' '.join(a)   объединение симовлов списка а с пробелом
#print(s)


# wordList = input().split()  вызов метода split  для разделения введеных слов
# print(wordList)

#wordList = input().split('a')  разделение введенного слова или последовательности по символу а
#print(wordList)

#intList = list(map(int, input().split()))
#print(intList)


# intList = list(map(int, input().split()))
# print(' '.join(map(str, intList)))

#intList = list(map(int, input().split()))
# print(*intList)   ПЕЧАТЬ ВСЕГО СПИСКА ЧЕРЕЗ ПРОБЕЛ - упрощенный вариант
# ==============================================================================
# Работа со списками

# a = [1, 2, 6 , 3, 2, 1, 2, 3, 8, 1, 2, 3]
# print(a.count(2)) Подсчет сколько раз встречается элемент в списке


# a = [1, 2, 6 , 3, 2, 1, 2, 3, 8, 1, 2, 3]
# a.append(25) добавление в конец списка нового элемента
# print(a)

# a = [1, 2, 6 , 3, 2, 1, 2, 3, 8, 1, 2, 3]
# b = [320, 325]
# a.extend(b) добавление в список а элементов из других списков как альтернатива можно селать a = a + b
# print(a)

# a = [1, 2, 6, 3, 2, 1, 2, 3, 8, 1, 2, 3]
# a.remove(2) - удаление первого элемента из списка
# print(a)

# a = [1, 2, 6, 3, 2, 1, 2, 3, 8, 1, 2, 3]
# b = a.copy()
# print(b)

#a = [1, 2, 6, 3, 2, 1, 2, 3, 8, 1, 2, 3]
#a.insert(2, 10) метод вставки на второе место значения 10
#print(a)

#a = [1, 2, 6, 3, 2, 1, 2, 3, 8, 1, 2, 3]
#a.pop() - удаление последнего элемента из списка
#print(a)
# ==============================================================================
# a = list(map(int, input().split())) # вывести в виде списка цифр разделенного на элементы
# i = 0
# while i < len(a):
#     if a[i] % 2 != 0:
#        a.pop(i)
#    else:
#        i += 1# если элемент не четный, то отрезать его из списка
#print(*a) # отображать список без скобок
#print(a) # отображать список со скобками
# ==============================================================================

a = list(map(int, input().split()))
b = []
for now in a:
    if now % 2 == 0:
        b.append(now)
print(b)














